# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'caskroom/drivers'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'awscli'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'phantomjs'
brew "openssl"
brew "gettext"
brew "libffi"
brew "pcre"
brew "glib"
brew "libpng"
brew "git"
brew "readline"
brew "autoconf"
brew "automake"
brew "sqlite"
brew "cmake"
brew "ffmpeg", args: ["with-fdk-aac", "with-freetype", "with-libass", "with-libquvi", "with-libvorbis", "with-libvpx", "with-opus", "with-sdl2", "with-x265"]
brew "eigen"
brew "faac"
brew "fdk-aac"
brew "lame"
brew "x264"
brew "xvid"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "fftw"
brew "flac"
brew "flex"
brew "freetds"
brew "fribidi"
brew "jpeg"
brew "libtiff"
brew "gdk-pixbuf"
brew "imagemagick"
brew "node"
brew "nvm"
brew "wget"


brew 'heroku-toolbelt'
# Make sure the toolbelt is the latest
heroku update

# Development
# brew 'php71', args: ['with-debug']

# Drivers
cask install 'fujitsu-scansnap-manager-ix500'

# Apps
cask 'aerial'
cask 'caffeine'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'sublime-text2'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'hazel'
cask 'quicksilver'
cask 'postgres'
cask 'spectacle'
cask 'dash'
cask 'textexpander'
cask '1password'
cask 'omnifocus'
cask 'omnigraffle'
cask 'duet'
cask 'textexpander'
cask 'fujitsu-scansnap-manager-ix500'
cask 'zoom'
cask 'ngrok'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Bear', id: 1091189122
mas 'Xcode', id: 497799835
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Kindle', id: 405399194
mas 'Rested', id: 421879749
mas 'Fantastical 2', id: 975937182
mas 'Slack', id: 803453959
mas 'Letter Opener Lite', id: 411897373
mas 'Spark', id: 1176895641
