# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

brew 'heroku-toolbelt'
# Make sure the toolbelt is the latest
heroku update

# Development
# brew 'php71', args: ['with-debug']

# Apps
cask 'aerial'
cask 'caffeine'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'sequel-pro'
cask 'slack'
cask 'sublime-text'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'hazel'
cask 'quicksilver'
cask 'postgres'
cask 'spectacle'
cask 'dash'
cask 'textexpander'
cask 'textmate'
cask '1password'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Bear', id: 1091189122
mas 'Xcode', id: 497799835
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
